app/Models/HomeModel.php

SELECT *
FROM `messages`
WHERE `sent_user_id` = '1'
AND `receive_user_id` = '2'
OR `sent_user_id` = '2'
AND `receive_user_id` = '1'
ORDER BY `date` DESC
---
    public function getMessages($sentUserID, $receiveUserID)
    {
        $query = $this->db->table('messages')
            ->where('sent_user_id', $sentUserID)
            ->where('receive_user_id', $receiveUserID)
            ->orWhere('sent_user_id', $receiveUserID)
            ->where('receive_user_id', $sentUserID)
            ->orderBy('date', 'DESC');

        return $query->get()->getResult();